In [1]:
import pandas as pd
df = pd.read_csv('C:\\Users\\Lenovo\\Downloads\\day.csv')
df
            
df['Numeric-2'].max()
df['Numeric'][df['Numeric-Suffix'] == '9th']
df.fillna(0, inplace=True)
df['Numeric-2'].mean()

14.064516129032258

In [2]:
import pandas as pd 
weather_data = {"day":["11/1/2019","12/2/2020","22/4/2012","12/5/2010","7/8/2014","9/9/2011"],
                "temperature":[32,35,28,24,32,31],
                "windspeed":[6,7,2,7,4,2],
                "event":["Rain","sunny","snow","snow","Rain","sunny"],
               }
df = pd.DataFrame(weather_data)
df
df.tail()
df.tail(1)
df.tail(4)
df.head(2)
df
df.shape
rows , columns = df.shape
rows
columns
df[:]
df.columns
rows
df.day
df
df["event"]
# type(df["event"])
# df[
df
df[["event","day"]]
df["temperature"].std()
df["temperature"].mean()
df.describe()
df[df.temperature>=32]
df[["day","temperature"]][df.temperature == df.temperature.max()]
df.index
df
df.set_index("day",inplace= True)
df
df.loc["22/4/2012"]
df.reset_index(inplace = True)
df

         day  temperature  windspeed  event
0  11/1/2019           32          6   Rain
1  12/2/2020           35          7  sunny
2  22/4/2012           28          2   snow
3  12/5/2010           24          7   snow
4   7/8/2014           32          4   Rain
5   9/9/2011           31          2  sunny

In [3]:
import pandas as pd
df = pd.read_excel("C:\\Users\\Lenovo\\Downloads\\RPA_Jobs.xlsx","Sheet")
df

    atif khan
0        khan
1  mandokhail

In [4]:
weather_data =  {"day":["11/1/2019","12/2/2020","22/4/2012","12/5/2010","7/8/2014","9/9/2011"],
                "temperature":[32,35,28,24,32,31],
                "windspeed":[6,7,2,7,4,2],
                "event":["Rain","sunny","snow","snow","Rain","sunny"],
               }
df = pd.DataFrame(weather_data)
df

         day  temperature  windspeed  event
0  11/1/2019           32          6   Rain
1  12/2/2020           35          7  sunny
2  22/4/2012           28          2   snow
3  12/5/2010           24          7   snow
4   7/8/2014           32          4   Rain
5   9/9/2011           31          2  sunny

In [5]:
weather_data = [
    ("1/2/2102",32,6,"rain"),
    ("2/3/2018",78,9,"sunny"),
    ("3/1/2021",88,10,"rain"),
]
df = pd.DataFrame(weather_data,columns=["day","temperature","windspeed","event"])
df
df

        day  temperature  windspeed  event
0  1/2/2102           32          6   rain
1  2/3/2018           78          9  sunny
2  3/1/2021           88         10   rain

In [6]:
df = pd.read_csv("C:\\Users\\Lenovo\\Downloads\\continent.csv",header= None, names=["tickers","day","windspeed","event"]) 
df

                 tickers       day windspeed   event
tickers              eps  revenue     price   people
google              27.8        89       888   ahmed
microsoft             -1        88       999    maaz
tata       not available        77       777    n.a.
mahindra            9. 8        -1      n.a.   uzair

In [7]:
df = pd.read_csv("C:\\Users\\Lenovo\\Downloads\\continent.csv")
# na_values = ["not available","n.a."])
df
df = pd.read_csv("C:\\Users\\Lenovo\\Downloads\\continent.csv", na_values = {
    "eps":["not available","n.a."],
    "revenue":["not available","n.a.",-1],
})
df

     tickers   eps  revenue  price  people
0     google  27.8        89    888  ahmed
1  microsoft    -1        88    999   maaz
2       tata   NaN        77    777   n.a.
3   mahindra  9. 8        -1   n.a.  uzair

In [8]:
df

     tickers   eps  revenue  price  people
0     google  27.8        89    888  ahmed
1  microsoft    -1        88    999   maaz
2       tata   NaN        77    777   n.a.
3   mahindra  9. 8        -1   n.a.  uzair

In [9]:
df.to_csv('new.csv', index=False)
df

     tickers   eps  revenue  price  people
0     google  27.8        89    888  ahmed
1  microsoft    -1        88    999   maaz
2       tata   NaN        77    777   n.a.
3   mahindra  9. 8        -1   n.a.  uzair

In [10]:
import pandas as pd
def convert_people_cell(cell):
    if cell=="n.a.":
        return "atif khan"
    return cell
def convert_revenue_cell(cell):
    if cell == "-1":
        return "n.a."
    return cell
df = pd.read_excel("C:\\Users\\Lenovo\\OneDrive\\Documents\\stock.data.xlsx","Sheet1", converters={
    "people":convert_people_cell,
    "revenue":convert_revenue_cell
})
df

     tickers   eps  revenue  price      people
0     google  27.8        89    888      ahmed
1  microsoft    -1        88    999       maaz
2       tata   NaN        77    777  atif khan
3   mahindra  9. 8        -1   n.a.      uzair

In [11]:
df.to_excel("new.xlsx",sheet_name="stocks", startrow=0, startcol=0, index=False)

In [12]:
df_stocks = pd.DataFrame({
    "tickers":["googl","microsoft","mahindra","tata"],
    "price":[24,44,66,22],
    "revenue":[9,8,7,6],
    "people":["atif","hammad","shahid","sanober"],
})
df_weather = pd.DataFrame({
    "city":["karachi","quetta","islamabad","peshawar"],
    "day":["1/1/2012","7/7/2021","3/4/2010","8/8/2011"],
    "temperaure":[33,29,34,31]
})

In [13]:
with pd.ExcelWriter("stocks_weather.xlsx") as writer:
    df_stocks.to_excel(writer,sheet_name = "stocks")
    df_weather.to_excel(writer,sheet_name = "weather")

In [14]:
import pandas as pd
df = pd.read_csv("C:\\Users\\Lenovo\\OneDrive\\Documents\\weather1.csv",parse_dates=['date'])
print(df.columns)
df
df.set_index("date",inplace = True)
df
new_df = df.fillna(0)
new_df
new_df = df.fillna({
    "temperature": 0,
    "winddpeed":0,
    "event":"no event"
})
new_df

Index(['date', 'temperature', 'winddpeed', 'event'], dtype='object')

           temperature winddpeed     event
date
2017-01-01       32mph        32      snow
2017-01-04       32mph        40     sunny
2017-01-05          32     28mph  no event
2017-01-06          32        28      rain
2017-01-07          32        28      snow
2017-01-08       32mph        28      snow
2017-01-09          32        28  no event
2017-01-10          32     28mph      rain
2017-01-11          32        28      snow

In [15]:
# new_df = df.fillna(method= "bfill",axis= "columns")
new_df = df.fillna(method= "bfill",limit = 1)
new_df
# new_df = df.interpolate()
new_df = df.interpolate(method = "time")

new_df
new_df = df.dropna()
new_df
new_df = df.dropna(how = "all")
new_df
new_df = df.dropna(thresh=2)
new_df

TypeError: Cannot interpolate with all object-dtype columns in the DataFrame. Try setting at least one column to a numeric dtype.

In [ ]:
dt = pd.date_range("01-01-2017","01-11-2017")
idx = pd.DatetimeIndex(dt)
df.reindex(idx)

In [ ]:
import pandas as pd
import numpy as np
df = pd.read_csv("C:\\Users\\Lenovo\\OneDrive\\Documents\\weather1.csv")
df

In [ ]:
new_df = df.replace(-99999,np.NaN)
new_df

In [ ]:
new_df = df.replace([-99999,-88888],np.NaN)
new_df

In [ ]:
new_df = df.replace({
    "temperature" : [-99999,-88888],
    "winddpeed" : [-99999,-88888],
},np.NaN)
new_df

In [ ]:
new_df = df.replace({
    -99999 : np.NaN,
    "no event" : "sunny"
})
new_df

In [ ]:
new_df = df.replace('[A-Za-z]',' ',regex=True)
new_df

In [ ]:
new_df = df.replace({
    "temperature" : '[A-Za-z]',
    "winddpeed" : '[A-Za-z]',
},'',regex=True)
new_df

In [ ]:
df = pd.DataFrame({
    "score":["runs","outs","average","run outs"],
    "player":["atif","ammad","hammad","lashkar"],
})
df

In [ ]:
new_df=df.replace(["runs","outs","average","run outs"],[1,2,3,4])
new_df

In [ ]:
import pandas as pd
df = pd.read_csv("C:\\Users\\Lenovo\\Downloads\\weather_by_cities.csv")
df

In [ ]:
g = df.groupby("city")
g

In [ ]:
for city,city_df in g:
    # print(city)
    print(city_df)

In [ ]:
g.get_group("mumbai")

In [ ]:
g.max()

In [ ]:
g.mean()

In [ ]:
g.describe()

In [ ]:
%matplotlib inline
g.plot()

In [ ]:
import pandas as pd
india_weather = pd.DataFrame({
    "city" :["mumbai","delhi","banglour"],
    "humidity":[40,50,60],
    "temperature" :[20,30,60],
})
india_weather

In [ ]:
us_weather = pd.DataFrame({
    "city" :["new york","paris","san Francisco"],
    "humidity" :[10,15,20],
    "temperature" :[20,30,40],
})
us_weather

In [ ]:
df = pd.concat([india_weather,us_weather])
df

In [ ]:
df = pd.concat([india_weather,us_weather],ignore_index = True)
df

In [ ]:
temperature_df = pd.DataFrame({
    "city" :["mumbai","delhi","banglour"],
    "temperature":[12,15,20],
},index = [0,1,2])
temperature_df

In [ ]:
windspeed_df = pd.DataFrame({
    "city" :["delhi","mumbai"],
    "windspeed" :[40,50],
},index = [1,0])
windspeed_df

In [ ]:
df = pd.concat([temperature_df,windspeed_df])
df

In [ ]:
df = pd.concat([temperature_df,windspeed_df],axis=1)
df

In [ ]:
temperature_df

In [ ]:
s = pd.Series(["humid","Dry","Rain"],name = "event")
s

In [ ]:
pd.concat([temperature_df,s],axis=1)

In [ ]:
df1 = pd.DataFrame({
    "city" : ["paris","sanfrancisco","new york","san"],
    "temperature" : [12,44,45,33],
})
df1

In [ ]:
df2 = pd.DataFrame({
    "city" : ["paris","sanfrancisco","new york","chicago"],
    "temperature" : [12,44,45,33],
})
df2

In [ ]:
df3= pd.merge(df1,df2, on="city",how="outer",indicator=True)
df3

In [ ]:
df3= pd.merge(df1,df2, on="city",how="outer", suffixes=("_","_right"))
df3

In [ ]:
import pandas as pd
df = pd.read_csv("C:\\Users\\Lenovo\\Downloads\\weather (1).csv")
df

In [ ]:
df1 = pd.melt(df,id_vars=["day"],var_name = "city", value_name = "temperature" )
df1

In [ ]:
import pandas as pd
df = pd.read_excel("C:\\Users\\Lenovo\\Downloads\\stocks.xlsx",header=[0,1])
df

In [ ]:
df.stack()

In [ ]:
# df.stack(level=0)

In [ ]:
df_stacked = df.stack()
df_stacked

In [ ]:
df_stacked.unstack()

In [ ]:
df = pd.read_excel("C:\\Users\\Lenovo\\Downloads\\stocks_3_levels.xlsx",header=[0,1,2])
df

In [ ]:
df.stack(level=1)

In [ ]:
import pandas as pd
df = pd.read_excel("C:\\Users\\Lenovo\\Downloads\\survey.xls")
df

In [ ]:
pd.crosstab(df.Nationality,df.Handedness)

In [ ]:
pd.crosstab(df.Sex,df.Handedness)

In [ ]:
import pandas as pd
# Sample dataframe
df = pd.DataFrame({
'Day': ['Mon', 'Tue', 'Wed'],
'Apple': [1, 3, 5],
'Banana': [2, 4, 6]
})
melted_df = df.melt(id_vars=['Day'], var_name='Fruit', value_name='Quantity')
melted_df

In [ ]:
import pandas as pd
df = pd.read_csv("C:\\Users\\Lenovo\\Downloads\\aapl_no_dates.csv")
df.head()

In [ ]:
rng = pd.date_range(start="6/1/2016",end="6/30/2016",freq='B')
rng

In [ ]:
df.set_index(rng,inplace=True)
df.head()

In [ ]:
daily_index = pd.date_range(start="6/1/2016",end="10/30/2016",freq='D')
daily_index

In [ ]:
daily_index.difference(df.index)

In [ ]:
%matplotlib inline
df.Close.plot()

In [ ]:
df["2016-06-01":"2016-06-10"].Close.mean()

In [ ]:
df.index

In [ ]:
import pandas as pd
df = pd.read_csv("C:\\Users\\Lenovo\\Downloads\\aapl.csv",parse_dates=["Date"], index_col="Date")
df.head(2)

In [ ]:
df.index

In [ ]:
df["2017-06-30"]

In [ ]:
df["2017-01"]

In [ ]:
df['Close'].resample('M').mean().head()

In [ ]:
df["2016-07"]

In [ ]:
%matplotlib inline
df.Close.plot()

In [ ]:
df["Close"].resample("M").mean().plot(kind='bar')

In [ ]:
import pandas as pd
df = pd.read_csv("C:\\Users\\Lenovo\\Downloads\\aapl_no_dates.csv")
df

In [ ]:
rng = pd.date_range(start="7/1/2017", end="7/21/2017",freq='B')
rng

In [23]:
from pandas.tseries.holiday import AbstractHolidayCalendar, Holiday, nearest_workday
from pandas.tseries.offsets import CustomBusinessDay

class MyBirthdayCalendar(AbstractHolidayCalendar):
    rules = [
        Holiday("Atif's Birthday", month=11, day=16)
    ]

myc = CustomBusinessDay(calendar=MyBirthdayCalendar())
print(myc)

<CustomBusinessDay>

In [24]:
pd.date_range(start="11/1/2024",end="11/30/2024",freq=myc)

DatetimeIndex(['2024-11-01', '2024-11-04', '2024-11-05', '2024-11-06',
               '2024-11-07', '2024-11-08', '2024-11-11', '2024-11-12',
               '2024-11-13', '2024-11-14', '2024-11-15', '2024-11-18',
               '2024-11-19', '2024-11-20', '2024-11-21', '2024-11-22',
               '2024-11-25', '2024-11-26', '2024-11-27', '2024-11-28',
               '2024-11-29'],
              dtype='datetime64[ns]', freq='C')

In [29]:
from pandas.tseries.holiday import AbstractHolidayCalendar, Holiday,nearest_workday
from pandas.tseries.offsets import CustomBusinessDay
import pandas as pd

class MyBirthdayCalendar(AbstractHolidayCalendar):
    rules = [
        Holiday("Atif's Birthday", month=11, day=16, observance=nearest_workday),
    ]

myc = CustomBusinessDay(calendar=MyBirthdayCalendar())
date_range = pd.date_range(start="11/1/2024", end="11/30/2024", freq=myc)
(date_range)

DatetimeIndex(['2024-11-01', '2024-11-04', '2024-11-05', '2024-11-06',
               '2024-11-07', '2024-11-08', '2024-11-11', '2024-11-12',
               '2024-11-13', '2024-11-14', '2024-11-18', '2024-11-19',
               '2024-11-20', '2024-11-21', '2024-11-22', '2024-11-25',
               '2024-11-26', '2024-11-27', '2024-11-28', '2024-11-29'],
              dtype='datetime64[ns]', freq='C')

In [45]:
b = CustomBusinessDay(weekmask ="Sun Mon Tue Wed Thu",holidays=["2024-07-17","2024-07-18"])
pd.date_range(start ="7/1/2024", end="7/29/2024", freq=b)

DatetimeIndex(['2024-07-01', '2024-07-02', '2024-07-03', '2024-07-04',
               '2024-07-07', '2024-07-08', '2024-07-09', '2024-07-10',
               '2024-07-11', '2024-07-14', '2024-07-15', '2024-07-16',
               '2024-07-21', '2024-07-22', '2024-07-23', '2024-07-24',
               '2024-07-25', '2024-07-28', '2024-07-29'],
              dtype='datetime64[ns]', freq='C')

In [73]:
import pandas as pd
dates = ["2017-01-05 2:30:00PM","Jan5,2017 14:30:00","01/05/2017","2017.01.05","20170105","abc"]
pd.to_datetime(dates, errors='coerce')

DatetimeIndex(['2017-01-05 14:30:00', '2017-01-05 14:30:00',
               '2017-01-05 00:00:00', '2017-01-05 00:00:00',
               '2017-01-05 00:00:00',                 'NaT'],
              dtype='datetime64[ns]', freq=None)

In [65]:
pd.to_datetime('5$1$2017', format='%d$%m$%Y')

Timestamp('2017-01-05 00:00:00')

In [64]:
import pandas as pd
pd.date_range(start="2024-06-11 09:00:00",periods=10, freq='30min')

DatetimeIndex(['2024-06-11 09:00:00', '2024-06-11 09:30:00',
               '2024-06-11 10:00:00', '2024-06-11 10:30:00',
               '2024-06-11 11:00:00', '2024-06-11 11:30:00',
               '2024-06-11 12:00:00', '2024-06-11 12:30:00',
               '2024-06-11 13:00:00', '2024-06-11 13:30:00'],
              dtype='datetime64[ns]', freq='30T')

In [83]:
import pandas as pd

t = 1720695851
dt = pd.to_datetime([t], unit='s')
dt

DatetimeIndex(['2024-07-11 11:04:11'], dtype='datetime64[ns]', freq=None)

In [85]:
import pandas as pd
y=pd.Period('2016')

In [86]:
y.start_time

Timestamp('2016-01-01 00:00:00')

In [87]:
y.end_time

Timestamp('2016-12-31 23:59:59.999999999')

In [99]:
m = pd.Period("2017-12",freq='M')
m

Period('2017-12', 'M')

In [95]:
m.start_time

Timestamp('2011-01-01 00:00:00')

In [96]:
m.end_time

Timestamp('2011-01-31 23:59:59.999999999')

In [100]:
m+1

Period('2018-01', 'M')

In [102]:
d=pd.Period('2017-02-28',freq='D')
d

Period('2017-02-28', 'D')

In [104]:
d.start_time

Timestamp('2017-02-28 00:00:00')

In [105]:
d.end_time

Timestamp('2017-02-28 23:59:59.999999999')

In [122]:
h=pd.Period("2024-12-31 23:00:00", freq="H")
h

Period('2024-12-31 23:00', 'H')

In [127]:
h

SyntaxError: invalid syntax (<ipython-input-127-e65418f0bd9f>, line 1)

In [119]:
h+1

Period('2025-01-01 00:00', 'H')

In [121]:
h+pd.offsets.Hour(12)

Period('2025-01-01 11:00', 'H')

In [130]:
import pandas as pd
df = pd.read_csv("C:\\Users\\Lenovo\\Downloads\\wmt.csv")
df

  Line Item  2017Q1  2017Q2  2017Q3  2017Q4  2018Q1
0   Revenue  115904  120854  118179  130936  117542
1  Expenses   86544   89485   87484   97743   87688
2    Profit   29360   31369   30695   33193   29854

In [131]:
df.set_index("Line Item",inplace=True)
df = df.T
df

Line Item  Revenue  Expenses  Profit
2017Q1      115904     86544   29360
2017Q2      120854     89485   31369
2017Q3      118179     87484   30695
2017Q4      130936     97743   33193
2018Q1      117542     87688   29854